Revit 2027 API
ParameterUtils.WriteSharedParametersToFile Method
 Generates a shared parameters text file from the shared parameters in a given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void WriteSharedParametersToFile(
	Document doc,
	string fileName
)
Public Shared Sub WriteSharedParametersToFile (
	doc As Document,
	fileName As String
)
public:
static void WriteSharedParametersToFile(
	Document^ doc,
	String^ fileName
)
static member WriteSharedParametersToFile :
        doc : Document *
        fileName : string -> unit
Parameters
doc Document
 Source Revit model to read shared parameters from.
fileName String
 Destination path for the shared parameters file. This must be in a writable location and the file cannot already exist.
Exceptions
Exception | Condition
ArgumentException |  doc is not a project document.
ArgumentNullException |  A non-optional argument was null
FileAccessException |  Thrown when the given file cannot be opened for write.
FileArgumentAlreadyExistsException |  The given path already exists.
InvalidPathArgumentException |  The destination file name includes one or more invalid characters.
Remarks
 Only shared parameters that are used in the project are written to the output.
See Also
Reference
ParameterUtils Class
Autodesk.Revit.DB Namespace